<!--
 * @FileDescription: 文字介绍轮播组件
 * @Author: 作者信息
 * @Date: 文件创建时间
 * @LastEditors: 最后更新作者
 * @LastEditTime: 最后更新时间
 -->
 <template>
    <DvBorderBox2 class="desc-template" :order="order">
      <div class="desc-container">
        <el-carousel height="100%" class="desc-carousel">
            <el-carousel-item v-for="item in descInfo" :key="item.name">
                <div class="desc-box">
                    <div class="desc-title">{{ item.name }}</div>
                    <div class="desc-content">{{ item.desc }}</div>
                </div>
            </el-carousel-item>
        </el-carousel>
      </div>
    </DvBorderBox2>
</template>

<script>
export default {
  name: 'DescribeTemplate',
}
</script>

<script setup>
import { defineProps, onMounted } from 'vue';
import { BorderBox2 as DvBorderBox2 } from '@kjgl77/datav-vue3';

let props = defineProps({
  order: String
});
console.log(props)

// const order = props.order;

const descInfo = [
    {
        name: '吴江实验幼儿园',
        desc: '南京师范大学吴江实验幼儿园是由吴江区政府、吴江区教育局委托南师大管理的一所公办幼儿园。南师大吴江实验幼儿园以“专业呵护未来”为使命，以“建设一所高质量幼儿园”为愿景，传承和践行陈鹤琴“活教育”思想，实施以幼儿为本，游戏中学习的课程，以达成吴江一流、苏州前列、江苏知名的办园目标。南京师范大学吴江实验幼儿园（苏州市吴江区水秀实验幼儿园）2021年9月1日正式建园，总建筑面积14142.11平米，设计规模为8轨24个班级。目前共有13个班级，393名幼儿。幼儿园现有正、副园长各1名，3位中层。教师队伍以年轻教师为主，32位专任教师，其中3年以下的新手老师23人，占72%；市级骨干教师1人，占3%，区级骨干教师5人，占16%。教师均为学前教育专业毕业；其中本科以上学历老师25人，占75%，大专学历8人，占25%。建园一年多来，南京师范大学教科院建立了对幼儿园内涵发展的支持体系，委派原晋霞副教授负责南师吴江实幼，从教师专业发展、课程实施指导和家园合作三个层面全方位指导和支持幼儿园。'
    }, 
    {name: '扬子中学', desc: '南京师范大学附属扬子中学由扬子石化公司于1984年创办。1988年扬子石化与南京师范大学联合办学。学校进入快速成长期，荣获“江苏省重点高中”、“国家级示范性普通高中”等称号，2003年首批转评为“江苏省四星高中”。学校现有学生2460名，53个班级；教职工252人，其中正高级教师2人，特级教师 1 人，市、区学科带头人39 人，博士 2 名，硕士119 人，“江苏省 333 高层次培养对象”2 名。近年来，在南师大、江北新区管委会和社会事业局的关心支持下，学校秉持“至精”核心理念，以“崇善崇上，惟精惟一”为学校精神，形成了“平民化精英养成”的办学特色，已跻身南京市一类高中行列（全市13所，包含5所市直属校），并成为南京市郊六所品牌高中之一。近年来，学校获得“江苏省文明单位”“江苏省和谐校园”“江苏省平安校园”“江苏省教育工作先进集体”“江苏省基础教育课程改革先进集体”“南京市师德先进群体”“南京市园林式校园”“南京市书香校园示范校”“南京市中小学心理健康教育特色学校”等荣誉。'}, 
    {name: '相城实验小学', desc: '南京师范大学相城实验小学是苏州高铁新城属地管理的全日制公办学校，苏州高铁新城管委会和南京师范大学联合创办，由南京师范大学苏州实验学校派驻专业团队管理。学校位于苏州高铁新城板块核心区域，相城大道西侧，蠡太路北侧，距长三角交通枢纽苏州高铁北站1.5公里。拥有一所高标准、高品质、现代化的校园，占地93亩多，建筑面积7.8万多平方，总投资约5亿多元，小学建设规模为10轨60个班,幼儿园为7轨21个班。学校以“追寻教育真谛，造就完全人格”为核心理念，将“守望童年，助梦起航”作为全校师生共同的使命追求。秉承“开放、融合、进取”的校风，“温暖、慧言、敏行”的教风，“求真、尚善、向美”的学风，与南京师范大学苏州实验学校优势互补、相融共进，成为高铁新城公共服务配套设施的重要板块，是助推区域高质量发展的战略布点。学校将继承南京师范大学百年教育传统，借鉴南京师范大学苏州实验学校民办名校的成功办学经验，传承两校的文化基因，打造高端教育品牌。'}, 
    {name: '滨湖实验学校', desc: '南京师范大学滨湖实验学校坐落在蠡湖未来城核心区，2021年9月1日正式启用，现有一至七年级共22个教学班，在校学生815人，在岗教师68人。学校以先进理念引领学校发展。确定了“做‘和创’教育，办未来学校”的办学目标。小学阶段立足培养“和身心、勇担当、善思考、会创造”的未来人才，中学阶段以“积极阳光的上进心，努力行动的责任心，体谅宽容的同理心，个人集体的荣誉感”为学生培养目标。学校以扎实研训塑造教师团队。成立“青年教师成长营”，组建南师大驻点教授“尹宗利导师制工作室”，加入“无锡市张明凤名师工作室”，多种资源助力教师发展。学校各级各类骨干教师占比40%，其中省特级教师2人，学科带头人以上9人。学校以创新思路推动家校共育。成立校级、年级、班级三级家委会，家校携手，合力育人；定期举行“校长有约”，倾听家长心声；用好家长职业和兴趣特长，开展家长活动课程；成立“家长成长研修营工作室”，提高家长家庭教育水平。'}, 
    {name: '邗江实验小学', desc: '南京师范大学附属邗江实验小学创办于2021年6月，是由南京师范大学和邗江区人民政府、西区新城管委会合作共建的一所实施六年制小学教育的全日制教育机构。学校坐落于风景秀丽的蜀冈之上，总用地面积4.8558万平方米，建筑面积约3.875万平方米。学校建设基于未来朝向，努力实现信息技术与教育教学深度融合，配备科创中心、机器人空间、3D打印室等专用教室，以一流的硬件装备助力儿童成长。学校现有教师67人，共24个班级，学生1036人。高级职称教师9人，中级职称教师17人，市区级名师22人。学校坚守“幸福每一名学生、成就每一位教师”的办学宗旨，唱响“面向未来，解放儿童”的办学主张，秉持“行是知之始，知是行之成”的校训，以国际前沿的知识建构（Knowledge Building)理论作为教学改革的理论支撑，全面实施2022版新课程标准，形成“让儿童像专家一样思考”的教学观。合作办学一年多来，学校先后有3项省级课题，3项市级课题成功立项，共有40多篇论文发表和获奖，多次接待全国各地的教育代表团来校参观学习交流，学校的“双减”工作和课后服务特色社团也得到专家领导的肯定。'}, 
    {name: '惠山实验中学', desc: '学校前身为江苏省天一中学初中部；2008年8月，独立建制为无锡市西漳中学；2011年9月，惠山区人民政府与南京师范大学联合办学，学校正式挂牌南京师范大学惠山实验中学；2019年，双方开展第二轮联合办学，通过南京师范大学教授工作室、南京师范大学教师教育学院骨干教师培育站等项目实施，不断深化合作内涵。办学过程中，学校坚持立德树人总目标，紧紧围绕“多元发展、和谐共进、不断超越，为学生健康成长和幸福人生奠基”的办学理念和“教育有温度，教师有才气，学生有内涵，办老百姓满意的家门口的优质学校”的办学目标，以江苏省课程基地——《基于融合思维的初中数学课程基地》建设和无锡市第二批“四有”好教师团队建设培育单位——“慧师惠学”好教师团队建设等平台为重要抓手，努力追求教育教学优质化、师资队伍专业化、内部管理规范化、设施设备现代化、生态景观园林化、环境氛围人文化，在家校共育，五育并举，学生成长发展指导，学生品格提升工程，心理健康教育，情感教育班集体建设，任务式导学课堂、“三生”课堂教学改革实践等方面积极探索，成果显著。'}, 
    {name: '溧阳实验小学', desc: '南京师范大学溧阳实验小学创建于2022年，是溧阳市政府和南京师范大学合作创办的一所公办小学，学校位于溧阳市奥体大道和码头西街交汇处，奥体大道866号。学校占地60亩，建筑面积约20800平米，设计6轨共36个班级，可提供1620个学位。2022年首次招收一年级90名学生入读。学校传承南京师范大学“厚生笃学”传统，依据溧阳市生态型城市和校园立体化结构的特点，设计“创建生态立体教科书”的办学方案，以“生态化教育”理念为指导，以“课程育人、活动育人、环境育人、文化育人、管理育人”为路径，绘制“全景育人”图谱，通过“成长学生、成全教师、成就学校”，实现“人校共荣”的办学愿景，切实落实“立德树人”的教育宗旨。学校开办7个多月，校园文化氛围突出，区域多所学校组团来校参观。学校被溧阳市高新区授予优秀团队；学校师生成长迅速，50%以上教师获得常州市骨干教师、溧阳市优秀教育工作者、赛课市一等奖、论文发表、课题立项等项目成长。办学未满一年，学校成为昆仑学区学校联盟基地学校，2023年3月，学校被授予江苏省重大课题研究实践基地。'}, 
    {name: '苏州实验学校', desc: '学校拥有幼儿园、小学、初中、高中四大学部三个校区，占地面积134亩，建筑面积近11.8万平方米，总投资超6亿元。目前在校学生3400多人,职工总数400多人，其中正高级教师6人，特级教师9人。建校来，学校全面贯彻落实党的教育方针，坚持立德树人，深入实施素质教育，不断取得良好的办学成效，赢得了社会和群众的普遍认可和赞赏。学校幼儿园已被评为江苏省优质幼儿园；学校小学部已成为周边群众尤其是适龄儿童家长非常认可和赞赏的学部；学校初中部在全面实施素质教育的基础上，连续取得初三学生中考四星级的高达标率；学校高中部秉承先进的办学理念，大力推进课堂教学改革，创新教学模式，提高了教学质量，学生高考连创佳绩。高中国际部陆续建成加拿大肯特国际高中项目以及英国剑桥国际高中项目，国际部在各类标准考试与竞赛中，都取得了优异成绩，国际部毕业生均被世界知名大学所录取。南京师范大学苏州实验学校办学几年，已声名鹊起，跻身于苏州市乃至江苏省基础教育优质学校的行列。'}, 
]

onMounted(() => {
  
})

</script>


<style lang="scss" scoped>
$orders: 1, 2, 3, 4, 5, 6, 7, 8;
div.desc-template{
  position: relative;
//   margin-top: 1vh;
  margin-bottom: 1vh;
  width: 42vw;
  height: 41vh;
  @each $order in $orders {
    &[order='#{$order}'] {
        order: $order;
    }
  }

  div.border-box-content {
    width: 42vw;
    height: 41vh;
    border-radius: 10px;

    div.desc-container {
        position: absolute;
        top: 0.7%;
        left: 0.7%;
        width: 98.6%;
        height: 98.6%;
        z-index: 10;
        border-radius: 8px;
        overflow: hidden;

        .desc-carousel {
            width: 100%;
            height: 100%;

            .el-carousel__container {
                width: 100%;
                height: 100%;

                .desc-box {
                    height: 100%;
                    width: 100%;
                    display: flex;
                    flex-flow: column nowrap;
                    align-items: center;
                    justify-content: space-between;
                    // row-gap: 5%;

                    div.desc-title {
                        // margin-top: 4%;
                        width: fit-content;
                        height: 6vh;
                        line-height: 6vh;
                        vertical-align: middle;
                        background-image: linear-gradient(
                            25deg,
                            #fdfffc 0%,
                            #a7d3ec 40%,
                            #3886eb 100%
                        );
                        -webkit-background-clip: text;
                        -webkit-text-fill-color: transparent;
                        -webkit-animation: hue 60s infinite linear;
                        word-wrap: break-word;
                        font-size: 1.6vw;
                        font-weight: 600;
                        text-align: center;
                        font-family: "Microsoft YaHei";
                    }

                    div.desc-content {
                        padding-left: 3%;
                        padding-right: 3%;
                        background-image: linear-gradient(
                            25deg,
                            #f4fbff 0%,
                            #c7dfed 70%,
                            #a7d3ec 100%
                        );
                        -webkit-background-clip: text;
                        -webkit-text-fill-color: transparent;
                        -webkit-animation: hue 60s infinite linear;
                        font-size: 1vw;
                        margin-bottom: 5%;
                    }
                }
            }
        }
    }

  }
}
</style>
