export { schoolData }

const schoolData = [
    {
        id: 1, imgSrc: 'http://localhost:8080/南京师范大学青岛附属学校.jpg', name: "南京师范大学青岛附属学校", 
        desc: '南京师范大学青岛附属学校（小学部）始建于1967年，2005年合并原来龙口小学、九水小学在原址重建。学校占地面积17468平方米，现有20个教学班，学生730名,教师60人。学校于2012年6月19日挂牌成为南京师范大学青岛附属学校（小学部），成为南师大在省外的第一所附属学校。借助南师大引领赋能学校高质量发展，教育教学质量不断提高，学校办学品质显著提升,迈入全区优质学校行列。学校现已获得全国海洋科普教育基地、全国足球特色学校、全国健康教育促进校、全国青少年艺术人才培训基地、山东省规范化学校、山东省环境教育基地、青岛市文明校园”、青岛市高水平现代化学校、青岛市校园文化建设示范校、青岛市促进中小学生全面发展“十个一”项目示范校等四十余项荣誉称号。2012年6月至今，南师大优质的教育资源，为学校内涵发展注入了强大动力。围绕“课程与课堂”、“学生与教师”、“适合与发展”，审视过去、实践现在、畅想未来，紧抓“童心教育”的主线，向着教育现代化行进，开启每个孩子的幸福旅程。'
    },
    {
        id: 2, imgSrc: 'http://localhost:8080/东吴实验小学.jpg', name: "东吴实验小学", 
        desc: '2015年，南京师范大学与苏州吴中经济开发区管理委员会合作共建“南京师范大学附属石湖实验小学（北校区）”，当年2月9日，南京师范大学合作办学指导专家吴永军教授工作室正式揭牌，标志着我校进入了高校合作、专家引领的发展新阶段。吴永军教授曾经携多位教授专家来校，为学校管理团队、青年教师进行培训，构建了学校特色课程框架，并对学校课堂教学、课题研究进行了指导。2018年4月，华伟教授成为我校指导专家。她指导我校德育团队申报学校品格提升工程项目，该项目虽未被立项，但为我校心理剧创作探索了新的思路。2019年4月起，吴晓玲教授作为我校指导专家，定期来校指导。期间，吴教授带领研究生团队，重点指导学校古诗词课程的开发与实施，创造性地指导各学科教师参与其中，让师生走近古诗词，感受传统文化之魅力。同时，吴晓玲教授走进青年教师课堂，为课堂教学把脉，引领成长。后续，我们需要得到南师大的专业指导。希望在高校专家的引领下，通过我们共同的努力，东吴实验小学能不断迈上新的台阶。'
    }, 
    {
        id: 3, imgSrc: 'http://localhost:8080/石湖实验小学.jpg', name: "南师大石湖实验小学", 
        desc: '南京师范大学附属苏州石湖实验小学是苏州市吴中经济技术开发区建设的高起点公办学校，2014年9月正式启用，坐落于吴中经济开发区兴吴路102号。邵昂路校区于2019年9月正式启用，位于开发区北小港路1号。学校形成了一校两区的办学格局。学校现有118个班级，4740名学生，312名教师。其中，中小学高级教师9人，一级教师66人，苏州市学科带头人3人，吴中区知名教师1人，吴中区学科带头人12人，吴中区骨干教师14人。建校八年以来，学校已有30名教师获区市评课选优一等奖，26名教师获区市级基本功大赛一等奖，57名教师获区市级素养大赛一等奖，30名教师获区市级学科带头人骨干教师等名师称号，近40位青年骨干教师走上管理岗位。在一大批年轻优秀的教师支撑下，学校在2020、2021年六年级的学业质量阳光监测中，连续两次综合排名区级第三。新初一学业水平监测中，连续三年获得教育高质量发展综合考核“优胜奖”。2022年度被评为区高质量发展优秀学校。学校先后获得国家级荣誉15个，省级荣誉16个，市级荣誉72个。'
    }, 
    {
        id: 4, imgSrc: 'http://localhost:8080/南京师范大学附属苏州石湖中学.png', name: "南京师范大学附属苏州石湖中学", 
        desc: '南京师范大学附属石湖中学2014年创建，学校占地52亩，建筑面积3.8万平米，设计规模10轨30班，配有一流的图书馆、三十多个科技、艺术专用教室，满足多样化课程开展的需求。学校现有150名教师，本科学历100%，其中，研究生53人，占比35%，特级教师1人，正高级教师1人，副高级教师16人，中级以上职称52%。拥有姑苏教育领军人才、姑苏教育拔尖、东吴教育拔尖6人，苏州市学科带头人6人，区级以上骨干教师24人。在学生培养方面也频传佳绩，省级、市级比赛榜上有名，学生团体比赛屡创佳绩：“神采飞扬”健美操社团获得全国冠军，机器人社团学生获得全国一等奖，朗诵、舞蹈社团学生获得吴中区金奖等数十项荣誉，办学成果先后被《中国教育报》、中央电视台发现之旅栏目报道。学校创建以来，依托南师大的办学品牌和教育资源，先后获评江苏省文明校园、江苏省智慧校园、苏州市现代学校制度实验学校、苏州最美最具人气的十大新现代校园、首批苏州市中小学家庭教育课程化项目拓展学校、首批苏州市人工智能教育实验学校等多项称号。'
    }, 
    {
        id: 5, imgSrc: 'http://localhost:8080/相城实验小学.jpg', name: "南京师范大学相城实验小学", 
        desc: '南京师范大学相城实验小学，是苏州高铁新城属地管理的全日制公办学校。2019年3月苏州高铁新城管理委员会与南京师范大学签署联合办学协议，共建南京师范大学相城实验小学,2019年9月1日投入使用。学校占地面积70多亩，建筑面积6万多平方米，总投资3亿余元。目前有43个班级，在校学生1901人,职工总数150多人，其中正高级教师1人，特级教师2人，大市学科带头人5人，区骨干教师多名。学校先后获评“江苏省教师发展研究基地学校”“苏州市教师发展示范基地校”“南京特殊教育师范学院实习基地”“苏州市特殊教育工作先进集体”“苏州市家访先进学校”“苏州市书法教育实验基地”“苏州市书法特色学校”“苏州市双减示范创建学校”“江苏省智慧校园”“相城区文明校园”“苏州市语言文字工作达标学校”等称号。现承担两项省级课题研究工作，“财经素养”特色课程被评为“苏州市基础教育前瞻性教学改革实验项目”，“卓远”四有好教师团队是苏州市重点培育团队。连续两年被评为相城区常规管理先进学校。'
    }, 
    {
        id: 6, imgSrc: 'http://localhost:8080/滨湖实验学校.jpg', name: "南京师范大学滨湖实验学校", 
        desc: '南京师范大学滨湖实验学校是滨湖区人民政府与南京师范大学合作共建的一所公办九年一贯制学校，目前暂设一个初中部和一个小学部。小学部位于无锡市滨湖区中南西路362号，总用地约40亩，建筑面积28591平方米，设计规模为6轨36个班。学校于2021年9月1日正式启用，现有一至六年级共20个教学班，在校学生766人，在岗教师57人。各级各类骨干教师占比41%，其中省市特级教师2人，江苏省333高层次人才培养对象1人，学科带头人以上8人，占比14%。学校于2021年9月1日正式启用，现有一至六年级共20个教学班，在校学生766人，在岗教师57人。各级各类骨干教师占比41%，其中省市特级教师2人，江苏省333高层次人才培养对象1人，学科带头人以上8人，占比14%。实施“未来学校愿景下‘童创’课程中心的集成式开发”省课程基地项目，开发“生活者课程、合作者课程、思考者课程、梦想者课程、勇敢者课程、领导者课程”，培养和身心、勇担当、善思考、会创造的未来人才。'
    }, 
    {
        id: 7, imgSrc: 'http://localhost:8080/邗江实验小学.jpg', name: "南京师范大学邗江实验小学",
        desc: '南京师范大学附属邗江实验小学创办于2021年6月，是由南京师范大学和邗江区人民政府、西区新城管委会合作共建的一所实施六年制小学教育的全日制教育机构。学校坐落于风景秀丽的蜀冈之上，总用地面积4.8558万平方米，建筑面积约3.875万平方米。学校建设基于未来朝向，努力实现信息技术与教育教学深度融合，配备科创中心、机器人空间、3D打印室等专用教室，以一流的硬件装备助力儿童成长。学校现有教师67人，共24个班级，学生1036人。高级职称教师9人，中级职称教师17人，市区级名师22人。校坚守“幸福每一名学生、成就每一位教师”的办学宗旨，唱响“面向未来，解放儿童”的办学主张，秉持“行是知之始，知是行之成”的校训，以国际前沿的知识建构理论作为教学改革的理论支撑，全面实施2022版新课程标准，形成“让儿童像专家一样思考”的教学观。合作办学一年多来，学校先后有3项省级课题，3项市级课题成功立项，共有40多篇论文发表和获奖，多次接待全国各地的教育代表团来校参观学习交流，学校的“双减”工作和课后服务特色社团也得到专家领导的肯定。'
    }, 
    {
        id: 8, imgSrc: 'http://localhost:8080/吴江实验小学.jpg', name: "南京师范大学吴江实验小学",
        desc: '2021年4月8日，苏州市吴江区政府和南京师范大学签署合作办学协议，决定共建南京师范大学吴江实验小学。学校设立“合作学校发展委员会”是学校运行的最高决策机构。另外，成立了南京师范大学专家指导委员会负责指导学校发展和业务培训。南京师范大学吴江实验小学位于苏州市吴江区松陵街道风清街520号，处于太湖新城核心地块，学校占地面积39.2亩，建筑总面积30488平方米（含7688平米地下人防车库），设计规模6轨，按省级二类标准装备。学校目前有43位老师，620名学生，共开设了一二年级15个班级。学校以“创办一所有爱、有心、有联结的一流现代化小学”为办学目标，以“专业培育未来”为教育核心理念，坚持多主体共育，营造良好的教育生态。学校独创了“三间三坊两平台”家校共育和教师发展新平台，着力培育“厚生敏行”的四有好教师团队。学校坚持以儿童为本，以“太湖情怀 世界眼光”为儿童发展目标，以太湖里“水精灵”为图腾寓意着孩子健康快乐、生动活泼地成长。'
    }, 
    {
        id: 9, imgSrc: 'http://localhost:8080/江阴实验小学.png', name: "南京师范大学江阴实验小学（在建）",
        desc: '2021年4月，我校与江阴市人民政府、江阴市新桥镇人民政府签订联合办学协议，合作共建“南京师范大学附属江阴实验小学”。校址位于江阴市新桥镇新杨路以东，翰园路以南，纵二路以西，新华路以北区块。小学为8轨，合计48个班，每班按45人设置，学生约2160人，教职工约 114人。学校开学时间待定。'
    }, 
    {
        id: 10, imgSrc: 'http://localhost:8080/溧阳实验小学.jpg', name: "南京师范大学溧阳实验小学",
        desc: '南京师范大学溧阳实验小学创建于2022年，是溧阳市政府和南京师范大学合作创办的一所公办小学，学校位于溧阳市奥体大道和码头西街交汇处，奥体大道866号。学校占地60亩，建筑面积约20800平米，设计6轨共36个班级，可提供1620个学位。2022年首次招收一年级90名学生入读。学校传承南京师范大学“厚生笃学”传统，依据溧阳市生态型城市和校园立体化结构的特点，设计“创建生态立体教科书”的办学方案，以“生态化教育”理念为指导，以“课程育人、活动育人、环境育人、文化育人、管理育人”为路径，绘制“全景育人”图谱，通过“成长学生、成全教师、成就学校”，实现“人校共荣”的办学愿景，切实落实“立德树人”的教育宗旨。学校开办7个多月，校园文化氛围突出，区域多所学校组团来校参观。学校被溧阳市高新区授予优秀团队；学校师生成长迅速，50%以上教师获得常州市骨干教师、溧阳市优秀教育工作者、赛课市一等奖、论文发表、课题立项等项目成长。办学未满一年，学校成为昆仑学区学校联盟基地学校，2023年3月，学校被授予江苏省重大课题研究实践基地。'
    }, 
    {
        id: 11, imgSrc: 'http://localhost:8080/杜英路实验小学.jpg', name: "南京师范大学杜英路实验小学",
        desc: '2022年3月，我校与南京市浦口区人民政府、南京地铁小镇开发建设集团有限公司签订联合办学协议，合作共建南京师范大学秋韵路实验中学、南京师范大学杜英路实验小学 、南京师范大学杜英路实验幼儿园，三所学校均为由甲方举办、具有独立法人资格的公办事业单位。学校预计2024年开学。小学为4轨，合计24个班，每个班按 45 人设置，总学生约1080人，校址位于南京市浦口区桥林街道，白檀路以东，杜英路以南，双塔路以西，青柳路以北。'
    }, 
    {
        id: 12, imgSrc: 'http://localhost:8080/黄江星河小学.jpeg', name: "南京师范大学附属黄江星河小学",
        desc: '2022年3月，我校与东莞市黄江镇人民政府签订联合办学协议，合作共建“南京师范大学附属黄江星河小学”，该校预计2024年开学。学校位于东莞市黄江镇丰源路南侧，占地约33644平方米。设计规模为每年级10个班，合计60个班，每个班45人，总学生约2700人，专职教师约116人。'
    }, 
    {
        id: 13, imgSrc: 'http://localhost:8080/南京师范大学相城实验幼儿园.jpg', name: "南京师范大学相城实验幼儿园",
        desc: '2019年3月苏州高铁新城管理委员会与南京师范大学签署联合办学协议，共建南京师范大学相城实验幼儿园，2019年9月1日投入使用。幼儿园占地面积20多亩，建筑面积9285.01平方米，总投资约2亿元。有21个班级，在校幼儿795人，教职工82人，1名区学科带头人，3名区教坛新秀。幼儿园始终秉承“追寻教育真谛，造就完全人格”的核心理念，继承南京师范大学百年教育传统，借鉴南京师范大学苏州实验学校成功的办学经验，承薪火、育后学、传身教。以先进的教育理念，凝聚共识，努力践行，打造开放、安全、宽松、温馨的教育环境，致力于为幼儿营造温暖、快乐、和谐的美好家园。南京师范大学相城实验幼儿园办学三年多来，先后被评为卫生合格园、餐饮适量安全A级食堂、苏州市语言文字工作达标学校、区教育系统“垃圾分类”优秀单位、苏州市优质园、苏州市特殊教育工作先进集体、幼儿教师优秀论文评选先进单位、童画之星全国幼儿美术创意大赛团体特等奖、全国乐蓓儿美育示范基地、南京特殊教育师范学院实习基地等称号。'
    }, 
    {
        id: 14, imgSrc: 'http://localhost:8080/吴江实验幼儿园.png', name: "南京师范大学吴江实验幼儿园",
        desc: '南京师范大学吴江实验幼儿园是由吴江区政府、吴江区教育局委托南师大管理的一所公办幼儿园。南师大吴江实验幼儿园以“专业呵护未来”为使命，以“建设一所高质量幼儿园”为愿景，传承和践行陈鹤琴“活教育”思想，实施以幼儿为本，游戏中学习的课程，以达成吴江一流、苏州前列、江苏知名的办园目标。南京师范大学吴江实验幼儿园（苏州市吴江区水秀实验幼儿园）2021年9月1日正式建园，总建筑面积14142.11平米，设计规模为8轨24个班级。目前共有13个班级，393名幼儿。幼儿园现有正、副园长各1名，3位中层。教师队伍以年轻教师为主，32位专任教师，其中3年以下的新手老师23人，占72%；市级骨干教师1人，占3%，区级骨干教师5人，占16%。教师均为学前教育专业毕业；其中本科以上学历老师25人，占75%，大专学历8人，占25%。建园一年多来，南京师范大学教科院建立了对幼儿园内涵发展的支持体系，委派原晋霞副教授负责南师吴江实幼，从教师专业发展、课程实施指导和家园合作三个层面全方位指导和支持幼儿园。'
    }, 
    {
        id: 15, imgSrc: 'http://localhost:8080/溧阳实验幼儿园.jpg', name: "南京师范大学溧阳实验幼儿园",
        desc: '南京师范大学溧阳实验幼儿园是由溧阳市人民政府与南京师范大学合作共建的一所公办幼儿园。幼儿园占地约20亩，满轨共18个班。2022年9月开园，2个班46名幼儿园，教职员工12名。幼儿园以陈鹤琴“大自然就是活教材”为理论依据，以溧阳“公园城市”构想为精神指引，以“像儿童的样子，与自然对话”为核心理念，打造一所“城市里的森林幼儿园”。开园短短7个月以来，幼儿园以立文化、建课程、带队伍、做口碑为工作重点，有条不紊地做好各项工作的同时，获得溧阳市园长专业领导力评比一等奖、溧阳高新区优秀团队奖，申报并立项溧阳市级课题，三名教师撰写的论文获得省一、二等奖。幼儿园环境设计注重空间融合、资源整合，边界移位、立体多元。1路是集木头、石板、青砖、鹅卵石为一身的一条神奇的路；2是将旋转滑梯、蹦床、沙池、树屋立体镶嵌在两个架空层，变身为探索、体锻、娱乐的悦动空间；3是木工坊、科学发现、宝贝厨房3个专用教室，成为有趣有益的学科互动和社团活动场所......'
    }, 
    {
        id: 16, imgSrc: 'http://localhost:8080/杜英路实验幼儿园.jpg', name: "南京师范大学杜英路实验幼儿园",
        desc: '2022年3月，我校与南京市浦口区人民政府、南京地铁小镇开发建设集团有限公司签订联合办学协议，合作共建南京师范大学秋韵路实验中学、南京师范大学杜英路实验小学 、南京师范大学杜英路实验幼儿园”，三所学校均为由甲方举办、具有独立法人资格的公办事业单位。学校预计2024年开学。幼儿园为4轨，合计12个班，每个班按30人设置，学生约360人，园址位于南京市浦口区桥林街道，白檀路以东，杜英路以南，双塔路以西，青柳路以北。'
    }, 
    {
        id: 17, imgSrc: 'http://localhost:8080/第二附属高级中学.jpg', name: "南京师范大学第二附属高级中学",
        desc: '学校沐浴着改革开放的春风不断发展壮大，1993年顺利地通过省重点中学验收，1997、2000年两次被评为省模范学校，2003年转评为省三星级高中。2004年10月，中国石化公司分离企业办社会职能，学校移交仪征市政府管理，由仪征市政府、南京师范大学和仪征化纤公司三方联合办学。2010年，学校正式升级为省四星级高中。学校秉承“明德、求索、笃行”的校训，在“自我超越，创造卓越”二附中精神引领下，跨越式发展呈现出“低进中出，中进高出，高进优出”的良好态势，赢得了社会和教育同行的广泛赞誉，已然成为仪征市普通高中教育的排头兵。近三年，在学校全体师生的共同努力下，学校高考本科达线率、优秀率不断提升：2020届，学校共有考生480名，本科达线428人，达线率89.2%；2021届，学校共有考生622名，本科达线565人，达线率90.8%，重点本科人数173人；2022届，学校共有考生602名，本科达线550人，重点本科157人，最高分612分。办学以来，有一批学生考入南京大学、东南大学、四川大学、武汉大学、重庆大学、山东大学、南京师范大学等国内一流高校。'
    }, 
    {
        id: 18, imgSrc: 'http://localhost:8080/第二附属初级中学.jpg', name: "南京师范大学第二附属初级中学",
        desc: '目前，学校两校区拥有学生近1400人，33个教学班。占地面积53820平方米,建筑面积16018平方米。学校始终秉持“以人为本，提供适合教育，为学生的终身发展和幸福人生奠定基础”的办学理念，谨遵“立志、博识、超越”的校训，坚持立德树人的原则，坚持“五育并举”，积极落实“双减”政策，守正创新，笃行不怠，屡创佳绩。截至2023年1月，学校拥有在编教职工178人，其中，高级教师79人，中级教师93人。扬州市“学科带头人”14人、“中青年教学骨干”6人、“教学能手”7人，扬州市特级教师2人。二附初中素质教育厚积薄发，成绩喜人。陈睿获得央视组织的“音乐大师课”一等奖；杨雅涵同学先后获得江苏省作文大赛特等奖、江苏省诗歌大赛特等奖，省市媒体竞相报道。二附初中还是排球特色学校、足球特色学校。三大球在仪扬地区屡获佳绩。学校较早地获得扬州市“合格初中”、扬州市模范学校、扬州市平安校园，江苏省重点中学、江苏省示范初中等称号。近年来先后被评为江苏省文化建设特色学校、江苏省初中学校团队建设先进学校等。'
    }, 
    {
        id: 19, imgSrc: 'http://localhost:8080/南师大附属扬子中学.jpg', name: "南师大附属扬子中学",
        desc: '南京师范大学附属扬子中学由扬子石化公司于1984年创办。1988年扬子石化与南京师范大学联合办学。学校进入快速成长期，荣获“江苏省重点高中”、“国家级示范性普通高中”等称号，2003年首批转评为“江苏省四星高中”。学校现有学生2460名，53个班级；教职工252人，其中正高级教师2人，特级教师 1 人，市、区学科带头人39 人，博士 2 名，硕士119 人，“江苏省 333 高层次培养对象”2 名。近年来，在南师大、江北新区管委会和社会事业局的关心支持下，学校秉持“至精”核心理念，以“崇善崇上，惟精惟一”为学校精神，形成了“平民化精英养成”的办学特色，已跻身南京市一类高中行列（全市13所，包含5所市直属校），并成为南京市郊六所品牌高中之一。近年来，学校获得“江苏省文明单位”“江苏省和谐校园”“江苏省平安校园”“江苏省教育工作先进集体”“江苏省基础教育课程改革先进集体”“南京市师德先进群体”“南京市园林式校园”“南京市书香校园示范校”“南京市中小学心理健康教育特色学校”等荣誉。'
    }, 
    {
        id: 20, imgSrc: 'http://localhost:8080/南京师范大学附属实验学校.jpg', name: "南京师范大学附属实验学校",
        desc: '南京师范大学附属实验学校是1999年由南京师范大学领衔并控股，联合南京亚东国际实业有限公司和南京仙林农牧场，经江苏省教育厅审批创办的一所实验学校，2000年9月开始办学。学校占地6.67公顷，建筑面积近4万平方米。目前，学校设有初中、高中和国际部，在校生2600多人；学校现有教职工360多人，2/3以上具有博士或硕士学历，1/3以上有国外研学经历。学校先后获全国优秀民办中小学、教育部基础教育课程改革研究中心、全国青少年足球特色学校等10个国家级荣誉称号；江苏省模范民办学校、江苏省教师发展示范基地学校、江苏省艺术特色学校、南京市推进素质教育示范校、南京市社会组织评估4A单位、南京市园林式校园等38个省市级荣誉称号。无论是初中、高中还是国际课程，都以较高的推进率、升学率帮助每一位孩子找到自我、树立自信。连续多年，学校的办学质量在市、区的评比中均获得最高奖励。学校“十四五”规划确立了高品质办学新目标，努力将学校建设成为中国基础教育的高品质示范性窗口学校，为南京师范大学基础教育的发展锦上添花。'
    }, 
    {
        id: 21, imgSrc: 'http://localhost:8080/南师大惠山实验中学.jpg', name: "南师大惠山实验中学",
        desc: '2011年9月，惠山区人民政府与南京师范大学联合办学，学校正式挂牌南京师范大学惠山实验中学；2019年，双方开展第二轮联合办学，通过南京师范大学教授工作室、南京师范大学教师教育学院骨干教师培育站等项目实施，不断深化合作内涵。近年来，学校先后获得中陶会苏霍姆林斯基教育思想研究示范基地学校、中陶会家庭专业委员会理事单位、全国青少年集邮活动示范基地、全国围棋特色学校、江苏省绿色学校、江苏省青少年科技教育先进学校、江苏省中小学课程基地与文化建设项目学校、江苏省教科研先进单位、无锡市文明校园、无锡市德育先进学校、无锡市义务教育现代化学校、无锡市平安校园示范校、无锡市“双减”项目实验学校等荣誉，并于2020、2021、2022年连续在惠山区教育高质量发展考核中获得综合奖一等奖。“十四五”期间，学校将继续依托联合办学的资源优势，充分发挥广大师生员工的积极性创造性，聚焦内涵建设，大力推进教育高质量发展，努力办人民满意的教育，奋力打造新时代高品质惠山教育的西漳高地！'
    }, 
    {
        id: 22, imgSrc: 'http://localhost:8080/南京师范大学青岛附属学校（初中部）.jpg', name: "南京师范大学青岛附属学校（初中部）",
        desc: '2012年6月，崂山区政府与南京师范大学达成战略合作协议，成立南京师范大学青岛附属学校。目前，初中部有18个教学班，在校学生623人，教职工80人。双方联合办学十年，学校在高效课堂模式、精品课程建设、教育管理创新以及智慧教学体系等方面有了长足发展，从一所普通初中发展为当地知名学校。学校发展壮大了“诚毅教育”品牌，构建了基于合作、对话、探究的“三元课堂”教学模式，丰富了“诚毅耐冬”课程体系。骨干教师培养成绩斐然，在区级以上各类比赛中获奖及获得荣誉称号的教师83人次，学校骨干教师人数翻了一番，其中国家级优质课评比19人获奖，省市级优质课13人获奖。十年来，学校先后荣获全国科学教育示范学校、全国足球特色学校、全国宋庆龄科技发明实践基地、中国青少年创客奥林匹克实践基地、山东省文明校园、山东省教育先进集体、山东省绿色校园等40余项荣誉称号。10余项课题市级以上获得立项或结题，其中国家级课题3项。科研成果获得青岛市一等奖，双方合作课题获得省科研成果二等奖。'
    }, 
    {
        id: 23, imgSrc: 'http://localhost:8080/南京师范大学灌云附属高级中学.jpg', name: "南京师范大学灌云附属高级中学",
        desc: '南京师范大学灌云附属高级中学于2013年11月与南师大签订联合办学协议后，与2014年8月有杨集镇整体搬迁至县东城区，新校区占地214亩，总投资2，4亿元，建筑面积7.9万平方米，现有66个教学班，在校学生3628人，教师249人。学校由原来的三星级普通高中顺利晋评为四星级高中；高考成绩逐年攀升，从原来的几十人逐步上升到2021年200多人，2022年的近400人。学校连续五年获得市县教学质量奖、教学提升奖。多次获得市县教科研工作先进集体等荣誉称号。仅2022年度，学校有1人在江苏省青年教师基本功大赛中荣获一等奖，全省一共10人。有1人晋升为正高级教师，7人晋升为高级教师，2人获评连云港市“港城名师”，另有2人获评连云港市“新333工程”教学名师，2人进入连云港市高层次人才“521工程”培养梯队，4人获得“灌云名师”称号。仅近两年，全校有3人获得连云港市基本功大赛一等奖，有6人获得连云港市优质课比赛一等奖。获评省心理健康教育教育基地，基地的课程教育和服务现已立足市域，辐射周边。'
    }, 
    {
        id: 24, imgSrc: 'http://localhost:8080/盐城实验学校.jpg', name: "南京师范大学盐城实验学校",
        desc: '作为盐城首家含小学、初中、高中一贯制的公办民营学校，从2017年建校五年来，中高考质量享誉市内外，已成功跻身盐城教育的第一方阵。初中教学质量是全市的最高峰。高考成果喜人：连续三年，与同批次、同类型学校对比，无论是尖优生的提优，还是本科生的孵化率，在全市首屈一指，成为质量发展、提质增效的样板。学校依托南师大资源和品牌优势，集中优质师资力量对学生进行“小班化和特色化”教育。学校文化得到进一步提炼，办学层次不断提升。在“融润教育”办学理念指引上，学校构建“五融五润”的课程体系，打造“学思相融、启探互润”的高效课堂，实施“和融共生”的管理策略，塑创“和融共进”文化品牌，为学校可持性发展铸入了灵魂。2022年11月12日，南师大盐城实验学校智创校区正式揭牌，从而开创了学校发展的新局面。办学特色鲜明，聚焦五育并举。为满足学生多样化选择和多元性发展的需求，学校成立了40个学生特色社团，开设了诸如游泳、棒球、戏剧表演等30余种活动课程。'
    },
    {
        id: 25, imgSrc: 'http://localhost:8080/苏州实验学校.jpg', name: "南京师范大学苏州实验学校",
        desc: '2013年12月，苏州高铁新城管理委员会与南京师范大学签署联合办学协议，共建南京师范大学苏州实验学校；2014年10月学校开工建设,2015年9月1日小学部、初中部投入使用，随后高中部和幼儿园分别在2016年9月1日、2017年2月投入使用。建校来，学校全面贯彻落实党的教育方针，坚持立德树人，深入实施素质教育，不断取得良好的办学成效，赢得了社会和群众的普遍认可和赞赏。学校幼儿园已被评为江苏省优质幼儿园；学校小学部已成为周边群众尤其是适龄儿童家长非常认可和赞赏的学部；学校初中部在全面实施素质教育的基础上，连续取得初三学生中考四星级的高达标率；学校高中部秉承先进的办学理念，大力推进课堂教学改革，创新教学模式，提高了教学质量，学生高考连创佳绩。高中国际部陆续建成加拿大肯特国际高中项目以及英国剑桥国际高中项目，国际部在各类标准考试与竞赛中，都取得了优异成绩，国际部毕业生均被世界知名大学所录取。'
    },
    {
        id: 26, imgSrc: 'http://localhost:8080/徐州大学路实验学校.jpg', name: "南京师范大学附属徐州大学路实验学校",
        desc: '南京师范大学附属徐州市大学路实验学校是铜山区委、区政府为发展铜山优质教育和南京师范大学合作共建的一所九年一贯制公办学校。学校创办于2017年8月，位于徐州市铜山区大学路66号，学校占地面积共59995㎡（约90亩），建筑面积47717㎡，建设投资2亿余元。学校先后荣获国际田联少儿趣味田径实验学校，全国体育联盟（教学改革）示范学校、全国小学跨界研究联盟学校、全国生态文明教育特色学校、省巾帼文明岗等荣誉称号，办学成果荣登《中国教育报》、江苏教育、学习强国省平台。学校秉承“亲大学之道，铺成长之路”办学理念，遵循“享受学习、精彩人生”办学宗旨，形成了以“致善教育”为核心的校园文化。学校精心打造“一景”“六园”“十二善”的物型文化景观，开放式图书馆，让学生随处可阅，随时可读；致善书院，让图书馆成为校园的风景，师生的精神家园；校史馆，充盈着文化的魅力，彰显着办学的底蕴。学校坚持党团队“一体化”建设，以党建促团建，带队建，形成了“四结合四促进”的党建品牌、“三建三引三培养”的团建品牌和“五育融合，五好共筑”队建品牌。'
    },
    {
        id: 27, imgSrc: 'http://localhost:8080/深圳龙岗实验学校.jpg', name: "南京师范大学深圳龙岗实验学校",
        desc: '南京师范大学深圳龙岗实验学校创办于2019年7月，是深圳市龙岗区教育局直属的九年一贯制公办学校，是南京师范大学在深首个合作办学学校，也是南京师范大学在粤港澳大湾区的首个合作办学学校。南京师范大学深圳龙岗实验学校秉承师范院校与区域经济社会发展深度融合的生动实践，对提升区域教育水平、促进教育均衡起到了重要作用。学校办学规模为36个班，其中中学12个班、小学24个班。目前已开设班级36个，在校学生人数1748人，其中小学生1062人，初中生686人。共有教职工133人，其中专任教师106人，87%的教师是近三年校招的应届毕业生，研究生及以上学历教师占比67%，可以说这是一只年轻、有活力、高学历、高素质的教师队伍。学校秉承“抱朴守一，做真教育”的办学理念，以“责任”为校训，致力于培育德智体美劳全面发展的社会主义建设者和接班人，办人民满意的教育。在学校全体师生的共同努力下，南京师范大学深圳龙岗实验学校得到了各级领导、教育同行、周边家长学生的肯定。学校注重年轻教师的培养，教师及其指导学生每学期在市、区各级比赛中都能取得一等奖、二等奖等好名次。'
    },
    {
        id: 28, imgSrc: 'http://localhost:8080/东莞黄江星河中学.jpeg', name: "南京师范大学附属东莞黄江星河中学",
        desc: '2020年9月，我校与东莞市黄江镇人民政府签订联合办学协议，合作共建“南京师范大学附属黄江星河中学”，该校预计2024年开学。学校位于东莞市黄江镇东龙路东侧，占地约33700平方米。设计规模为每年级14个班，合计42个班，每个班50人，总学生约2100人，专职教师约126人。'
    },
    {
        id: 29, imgSrc: 'http://localhost:8080/滨湖实验学校.jpg', name: "南京师范大学滨湖实验学校（蠡湖初中部）",
        desc: '南京师范大学滨湖实验学校初中部坐落在蠡湖未来城核心区，2021年9月1日正式启用，现有一至七年级共22个教学班，在校学生815人，在岗教师68人。学校以扎实研训塑造教师团队。成立“青年教师成长营”，组建南师大驻点教授“尹宗利导师制工作室”，加入“无锡市张明凤名师工作室”，多种资源助力教师发展。学校以创新思路推动家校共育。成立校级、年级、班级三级家委会，家校携手，合力育人；定期举行“校长有约”，倾听家长心声；用好家长职业和兴趣特长，开展家长活动课程；成立“家长成长研修营工作室”，提高家长家庭教育水平。学校办学一年多来，获评“江苏省课程基地和校园文化项目、”“江苏省智慧校园”“、“无锡市素质教育实践基地” 、”“无锡市红领巾媒介素养实践基地”；4名教师获评区学科带头人，6名教师获评区教学能手，省、市、区级表彰28人次，省、市、区级赛课或基本功竞赛获奖35人次；学校合唱团、竖笛、网球、女足、射击、航模等项目在市、区级竞赛中分获一、二等奖15次，数名学生在市、区级体艺科技等竞赛中斩获佳绩。'
    },
    {
        id: 30, imgSrc: 'http://localhost:8080/溧阳高新区实验初中.png', name: "南京师范大学溧阳市高新区实验初级中学",
        desc: '2023年4月，我校将与溧阳市人民政府签订联合办学协议，合作共建“南京师范大学溧阳市高新区实验初级中学”，该校为甲方教育行政部门举办的具有独立法人资格的公办事业机构。校址位于溧阳市高新区，初中规模为12轨，合计36个班，每个班按45人设置，总学生约1620人，教职工约135人。学校开学时间待定。'
    },
    {
        id: 31, imgSrc: 'http://localhost:8080/常州新龙实验学校.jpg', name: "南京师范大学常州新龙实验学校",
        desc: '2021年5月13日，南京师范大学与常州新北区人民政府签订协议，合作共建南师大附属常州市新北区新龙实验学校。学校位于常州高铁新城区域庄只路36号，占地75亩，校舍建筑面积5.8万平米，投入资金3.1亿。学校属于九年一贯制学校，设计规模为8轨72个班，其中小学48个班，初中24个班。学校于2022年7月建成，挂牌更名为南京师范大学常州实验学校。2022年8月，学校正式对外招生。现有一年级4个班，136名学生；七年级14个班，611名学生（含新桥初中七年级过渡学生）。招聘教师19名，校级领导4名。自合作办学以来，南京师范大学与新北区区政府、常州实验学校共同谋划，学校建设已经初见成效。根据合作协议，南京师范大学主持进行了学校校长的选聘工作，并成功招聘了南京知名校长担任学校校长;新北区根据与南京师范大学的协议，遴选与引进了一批理念先进、品格高尚、业务精良、具备开阔视野和卓越能力、具有团队意识和创新精神的教师，组成学校教师团队。虽然学校刚刚组建，但是学校教师目前获得区级以上专业称号占63%，获得区基本功、评优课一等奖及以上占56%。'
    },
    {
        id: 32, imgSrc: 'http://localhost:8080/六合区实验学校.jpeg', name: "南京师范大学六合实验学校",
        desc: '2021年10月，我校与南京市六合区人民政府、南京六合新城建设（集团）有限公司签订联合办学协议，合作共建“南京市六合区实验学校”。学校含一所幼儿园、一所小学和一所初中，均为甲方教育行政部门举办的分别具有独立法人资格的公办事业机构。学校预计于2024年开学。校址位于雄新路以南、通马路以西、甘棠路以北、滁马路以东，占地面积约96350㎡。幼儿园规模为5轨，合计15个班，每个班按30人设置，学生约450人，在编教职工约35人。小学规模为8轨，合计48个班，每个班按45人设置，总学生约2160人，教职工约120人。初中占地面积约34300m，规模为8轨，合计24个班，每个班按50人设置，总学生约1200人，教职工约90人。'
    },
    {
        id: 33, imgSrc: 'http://localhost:8080/秋韵路实验中学.jpg', name: "南京师范大学秋韵路实验中学",
        desc: '2022年3月，我校与南京市浦口区人民政府、南京地铁小镇开发建设集团有限公司签订联合办学协议，合作共建南京师范大学秋韵路实验中学、南京师范大学杜英路实验小学 、南京师范大学杜英路实验幼儿园”，三所学校均为由甲方举办、具有独立法人资格的公办事业单位。学校预计2024年开学。初中为8轨，合计24个班，每个班按50人设置，总学生约1200人，校址位于南京市浦口区桥林街道，白檀路以东，紫菀路以南，双塔路以西，秋韵路以北。'
    },
    {
        id: 34, imgSrc: 'http://localhost:8080/滨湖实验学校九龙湾分校.jpg', name: "南京师范大学滨湖实验学校九龙湾分校",
        desc: '2022年5月，我校与无锡市滨湖区人民政府签订联合办学协议，合作共建“南京师范大学滨湖实验学校九龙湾分校”，学校是一所九年一贯制学校，是具有独立法人资格的区属公办事业机构，设有一个小学部和一个初中部。校址位于胡埭刘闾路与安泰路交叉口西北侧，总用地约75亩，小学部6轨，合计36个班，每个班按45人设置，学生合计约1620人，教职工约95人;中学部6轨，合计18个班，每个班按50人设置，学生合计约900人，教职工约70人。其中小学部预计于2024年开学，中学开学时间待定。'
    }
]